{
    "name": "Black Bean Buddha Bowl with Gingery Lemon Tahini Sauce",
    "link": "",
    "cuisine": "",
    "tags": [
        "bowl",
        "vegetarian"
    ],
    "ingredients": [
        "1 cup dry black beans  ((or sub 2 15-oz. cans black beans // amount as recipe is written — adjust as needed))",
        "1 cup uncooked brown rice  ((~3 cups cooked rice // amount as recipe is written — adjust as needed))",
        "1 small bundle kale, chopped, large stems removed",
        "1 batch Gingery Lemon Tahini Sauce",
        "3/4 cup Cabbage Apple Sauerkraut ((or sub Carrot Beet Sauerkraut, Kimchi, or store-bought))",
        "1 small bundle green onion, thinly sliced",
        "1 ripe avocado, sliced",
        "4 Tbsp sea vegetable of choice ((optional // we prefer dulse or nori, crumbled or chopped))",
        "4 tsp sesame seeds, divided ((optional))"
    ],
    "instructions": [
        "Prepare brown rice using either the Instant Pot method or the Perfect Brown Rice method (which doesn’t require an Instant Pot). Set aside. Prepare black beans using either the Instant Pot method or the Black Beans from scratch method (which doesn’t require an Instant Pot). Set aside. (I would recommend making the black beans in the Instant Pot — if you have one — and the brown rice on the stovetop so they can cook simultaneously).",
        "Prepare 1 batch of our Gingery Lemon Tahini Sauce (or our 3-ingredient Tahini Sauce or Quick Ginger Miso Tahini Dressing). Set aside.",
        "Steam kale for 1-2 minutes, or until wilted but vibrant green. Set aside.",
        "To serve, divide grains and beans between serving bowls and top with steamed kale, 3 Tbsp each sauerkraut or kimchi, sliced green onion, avocado, sea vegetables (optional), and sesame seeds (optional).",
        "Best when fresh. Store leftovers (sauce separate) in the refrigerator for up to 3-4 days. Kale is best when steamed fresh. Grains and beans are freezer friendly, the rest is best when fresh."
    ],
    "servings": "",
    "nutrition": ""
}