{
    "name": "Cauliflower Mac and Cheese (Keto!) - Fit Foodie Finds",
    "link": "",
    "cuisine": "",
    "tags": [
        "vegetarian",
        "comfort"
    ],
    "ingredients": [
        "32 oz. cauliflower, chopped (about 10 cups)",
        "2 tablespoons olive oil",
        "1.5 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "1/8 teaspoon salt",
        "1/8 teaspoon black pepper",
        "1.5 tablespoons butter",
        "2 tablespoons white whole wheat flour (almond flour for a keto option)",
        "1.5 cup 2% milk",
        "1.5 cups cheddar cheese",
        "1/4 cup greek yogurt",
        "2 tablespoons cream cheese",
        "1/8 teaspoons salt",
        "1/3 cup shredded parmesan cheese"
    ],
    "instructions": [
        "Preheat the oven to 400ºF and spray a 9×13 in. casserole dish with non-stick cooking spray.",
        "Toss the cauliflower with olive oil, garlic powder, onion powder, salt and pepper. Toss until all the cauliflower is covered with spice.",
        "Roast cauliflower for 12 minutes, toss, and roast for another 12 minutes.",
        "While cauliflower is roasting, prepare the cheese sauce by heating butter in a medium-sized sauce pan over medium/high heat until melted.",
        "Add in flour and mix until the butter and flour turn into a thick paste.",
        "Next, turn the heat to low/medium heat and slowly pour milk into the saucepan while consistently whisking the milk into the butter and flour mixture.",
        "Whisk over low heat until the milk mixture thickens. Remove from heat and whisk in cheddar cheese, Greek yogurt, cream cheese, and salt. Whisk until all the cheese is melted.",
        "Remove cauliflower from the oven and pour cheese sauce over the cauliflower and mix, making sure all cauliflower is covered in cheese sauce.",
        "Sprinkle parmesan cheese over the top of the cauliflower and turn the oven to broil.",
        "Place the cauliflower back into the oven and broil on high for 2-5 minutes (time varies based on the broiler).",
        "Remove from the oven and enjoy!"
    ],
    "servings": "",
    "nutrition": ""
}