{
    "name": "Cauliflower Chicken Mac and Cheese - Fit Foodie Finds",
    "link": "",
    "cuisine": "",
    "tags": [
        ""
    ],
    "ingredients": [
        "1 lb. boneless, skinless chicken breast",
        "1 tablespoon olive oil",
        "1/2 a head of cauliflower (4 cups florets)",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground pepper",
        "1/2 teaspoon garlic powder",
        "1/2 cup chicken broth",
        "8 oz. gluten-free macaroni elbows (we used TruRoots)",
        "3 cups 1% milk (or any kind, even dairy free)",
        "3 tablespoons tapioca flour",
        "8 oz cheddar cheese",
        "Bread Crumbs",
        "Bacon",
        "Green Onion"
    ],
    "instructions": [
        "Preheat the oven to 375ºF and spray a large casserole dish with non-stick cooking spray. Set aside.",
        "Chop cauliflower into 1.5-inch florets and place in casserole dish.",
        "In a large pan, heat a tablespoon of olive oil over high heat.",
        "Season chicken with salt and pepper, to taste and brown for 1 minute to 1.5 minutes on each side. Then, slice chicken into chunks and place in casserole dish. Set aside.",
        "Make cheese sauce by heating 3 cups of 1% milk over medium/high heat while stirring consistently.",
        "Once simmering, add in tapioca flour one tablespoon at a time and continue whisk so that milk does not burn.",
        "Once milk starts to thicken (8-10 minutes in), turn heat down to low and slowly add in 8 oz. shredded white cheddar cheese. Don’t forget to continue whisking!",
        "Add salt, pepper, and garlic powder into cheese sauce.",
        "Pour cheese sauce over the top of chicken/cauliflower and then add 1/2 cup of chicken broth. Mix until everything is combined.",
        "Bake 375ºF, uncovered, for 30 minutes.",
        "Remove casserole from oven and add noodles and stir.",
        "Bake for 5 minutes. Remove and stir. Place back in and bake for 5 more minutes.",
        "Remove casserole from oven and let sit for 5-10 minutes on your stovetop. Continue to to stir often to release heat so that the noodles do not continue to cook.",
        "Once casserole is cooled, top with optional bread crumbs, bacon, and green onions.",
        "Enjoy!"
    ],
    "servings": "",
    "nutrition": ""
}