{
    "name": "Copycat Chipotle Chicken Burrito Bowl Recipe - Fit Foodie Finds",
    "link": "",
    "cuisine": "",
    "tags": [
        "bowl",
        "mexican"
    ],
    "ingredients": [
        "16 oz. chicken breasts",
        "salt and pepper, to taste",
        "1/2 lime, juiced",
        "1 cup long grain brown rice (option to sub white rice, but note the different liquid ratio)",
        "2 cups water",
        "1/2 lime, juiced",
        "1/4 cup fresh cilantro, chopped",
        "1/8 teaspoon salt",
        "1 large red pepper, sliced",
        "1 large green pepper, sliced",
        "1/2 large yellow onion, sliced",
        "2 tablespoons olive oil",
        "2 teaspoons minced garlic",
        "2 teaspoons chili powder",
        "1 teaspoon ground cumin",
        "1/8 teaspoon paprika",
        "salt and pepper, to taste",
        "1 15 oz. can pinto beans, rinsed (option to sub black beans)",
        "1/8 teaspoon salt",
        "pepper, to taste",
        "Cheese",
        "Guacamole",
        "Pico de gallo"
    ],
    "instructions": [
        "Preheat oven to 375ºF and line a baking sheet with tin foil and spray with cooking spray.",
        "Place chicken breast on bakings sheet and season with salt and pepper, to taste.",
        "Bake at 375ºF for 20-25 minutes. Once the chicken is cooked squeeze on some fresh lime juice. Dice into chunks.",
        "Place rice and water into a medium pot and bring to a boil. Once boiling, cover and turn heat to low. Let simmer for 30-40 minutes or until all water has absorbed.",
        "Once rice is cooked, squeeze on some fresh lime juice, and season with fresh cilantro and salt. Mix.",
        "Place olive oil in a large sauce pan and heat to medium/high. Add in peppers and onion and saute for 7-10 minutes or until onions are translucent.",
        "Season with minced garlic, chili powder, cumin, paprika, salt, and pepper.",
        "Place beans, salt, and pepper into a small pot and turn to medium/high heat.",
        "Cook for 5 minutes or until beans are warm.",
        "Assemble chicken burrito bowls by separating the chicken, rice, beans, and fajita veggies into 4 servings. Then, top with your favorite toppings such as cheese, guacamole, and pico de gallo!",
        "If using as leftovers, option to separate everything out into meal prep containers. Will stay good for up to 4 days."
    ],
    "servings": "",
    "nutrition": ""
}