{
    "name": "Crispy Miso Chickpea Bowls with Garlic Sesame Dressing",
    "link": "",
    "cuisine": "",
    "tags": [
        "vegetarian",
        "bowl"
    ],
    "ingredients": [
        "2 cups cooked brown rice, rice noodles, quinoa, or cauliflower rice ((or sub more vegetables — suggestions below))",
        "1 15-ounce can chickpeas, rinsed, well drained, and towel dried",
        "2 Tbsp toasted or untoasted sesame oil ((if oil-free, you can try omitting or adding more maple syrup as needed))",
        "1 Tbsp white or yellow miso paste  ((ensure vegan friendly — we prefer Miso Master brand chickpea miso))",
        "2 tsp maple syrup",
        "1 tsp chili garlic sauce or 1/2 tsp red pepper flake  ((adjust to preferred heat level))",
        "1 tsp chili garlic sauce or 1/2 tsp red pepper flake  ((adjust to preferred heat level))",
        "1 Tbsp maple syrup  ((plus more to taste))",
        "1 Tbsp coconut aminos  ((or sub tamari or soy sauce if not gluten-free))",
        "2 Tbsp lime juice",
        "4 Tbsp rice vinegar  ((or sub white or apple cider vinegar — results will vary))",
        "1 ½ Tbsp sesame oil ((if oil-free omit))",
        "4 cloves garlic, minced ((optional // 4 cloves yield ~2 Tbsp))",
        "1 ½ cups thinly sliced vegetables  ((such as red or green cabbage, bell pepper, cucumber, or carrots))",
        "1/4 cup finely chopped roasted salted peanuts or cashews ((optional))",
        "Quick Ginger Garlic Miso Tahini Dressing ((optional))"
    ],
    "instructions": [
        "If serving with grains, prepare at this time (follow links above for instructions).",
        "In the meantime, if preparing chickpeas, preheat oven to 425 degrees F (218 C). Rinse and drain chickpeas well. Then pat very dry&nbsp;— this will help them crisp up.",
        "To a medium mixing bowl add oil, miso paste, maple syrup, and chili garlic sauce or red pepper flake and whisk to combine. Then add chickpeas and toss to coat.",
        "Arrange on a parchment-lined baking sheet (or more baking sheets as needed if increasing batch size) and bake for 20-25 minutes, tossing/stirring once at the halfway point to ensure even baking. They're done when crisp and deep golden brown (see photo). Set aside.",
        "Next prepare dressing by adding chili garlic paste or red pepper flake, maple syrup, coconut aminos or tamari, lime juice, vinegar, sesame oil, and garlic (optional) to a small mixing bowl and whisking to combine.",
        "Taste and adjust flavor as needed, adding more lime or vinegar for acidity, salt or coconut aminos or tamari for saltiness, maple syrup for sweetness, or chili garlic sauce or red pepper flake for added heat. You want this to be quite flavorful so don’t be shy!",
        "Prepare any vegetable garnishes / toppings at this time and set aside.",
        "To serve, divide grains between serving bowls and top with chickpeas, veggies of choice, and dressing. This bowl is elevated with the addition of our Quick Ginger Garlic Miso Tahini Dressing as well!",
        "Store leftovers covered in the refrigerator up to 3 days. Store with sauce(s) on the side. Not freezer friendly."
    ],
    "servings": "",
    "nutrition": ""
}