{
    "name": "Easy Vegan Sausage (Soy- & Gluten-Free!)",
    "link": "",
    "cuisine": "",
    "tags": [
        "protein",
        "vegetarian"
    ],
    "ingredients": [
        "1 cup cooked + cooled quinoa  ((see notes for cooking instructions))",
        "1 15-ounce can pinto beans  ((rinsed and dried // or sub black beans))",
        "2 heaping cups thinly sliced cremini or button mushrooms",
        "2 Tbsp coconut aminos  ((or sub tamari, but start with less as it's saltier))",
        "2/3 cup raw pecans  ((or sub other nut such as walnuts, or seed such as sunflower seeds))",
        "1/2 tsp each sea salt and black pepper  ((plus more to taste))",
        "4 cloves garlic, minced",
        "1 Tbsp fresh chopped thyme, rosemary, or sage  ((or sub half the amount in dried))",
        "2 tsp smoked paprika",
        "1/2 tsp fennel seeds",
        "1/4 tsp ground cayenne pepper or red pepper flake ((optional // omit for less heat))",
        "1 pitted medjool date ((optional // for binding — offsets the spice))",
        "Oil for cooking ((optional))"
    ],
    "instructions": [
        "If you haven’t done so, cook quinoa and set aside to cool (see notes for instructions).",
        "Preheat oven to 350 degrees F (176 C) and spread rinsed, dried beans onto a parchment-lined baking sheet. Bake beans for ~10 minutes. They should appear dry and cracked open (when cooked this way, they do not become mushy in the sausage mix). Set aside to cool.",
        "In the meantime, heat a medium to large cast-iron or metal skillet over medium/medium-low heat. Once hot, add the sliced mushrooms and coconut aminos and cook on medium/medium-high for about 4-5 minutes, stirring frequently or until they’re browned, fragrant, and cooked down to half their original size (see photo). Set aside.",
        "To a food processor, add quinoa and pecans and blitz/pulse into a loose meal (some texture is good — you don’t want a powder).",
        "Next, add cooked beans, cooked mushrooms, sea salt and black pepper, garlic, fresh herbs, paprika, fennel, cayenne or pepper flake (optional), and date (optional for binding and well-balanced flavor). Pulse a few times to combine (some texture is good — you're not going for a purée).&nbsp;",
        "The texture should be moldable when squeezed in your hands. If too dry, add more coconut aminos. If too wet, you can stir (not blend) in some extra quinoa. NOTE: The more you pulse / blend, the wetter the texture will become. So pulse just until combined to preserve the texture.",
        "Taste a small amount and adjust flavor as needed, adding more cayenne pepper or red pepper flake for heat, salt to taste, coconut aminos for more depth of flavor / saltiness, or paprika for smokiness.",
        "Form the mixture into patties (about 8 as the recipe is written) using your hands first to form into balls and then pressing to form into discs. NOTE: At this point you can arrange the sausage between layers of parchment paper if stacking and refrigerate up to 4-5 days in advance for quick + easy cooking throughout the week. After 2 days, transfer to the freezer to keep fresh.",
        "TO COOK: Heat a large skillet over medium heat. Once hot, add just enough oil to coat the surface (or use a non-stick or seasoned cast iron pan) and add only as many patties as will fit comfortably in the pan. Sprinkle the tops with a bit more salt and black or red pepper. See notes for baking instructions.*",
        "Cook for 3-4 minutes or until the underside is browned (turn down heat if browning too quickly). Then gently flip with a spatula and cook on the other side for 3-4 minutes more, or until the underside is browned.",
        "Serve immediately as is or alongside other breakfast favorites, like our Best Vegan Breakfast Potatoes, Southwest Tofu Scramble, or Easy Vegan Scrambled “Eggs.”",
        "Store leftovers in the refrigerator up to 4-5 days or in the freezer up to 1 month. You can also make patties ahead of time (up to 1 month), freeze (uncooked), and thaw before cooking. Cook as instructed."
    ],
    "servings": "",
    "nutrition": ""
}