{
    "name": "Easy Chinese Chicken Salad (GFSoy-Free)",
    "link": "",
    "cuisine": "",
    "tags": [
        "salad"
    ],
    "ingredients": [
        "2 small to medium chicken breasts, shredded  ((~2 ½ cups shredded chicken as recipe is written // see notes for vegan options))",
        "3 cups thinly sliced napa cabbage",
        "2 cups thinly sliced red cabbage",
        "1 large carrot, shredded",
        "1 bundle green onions, thinly sliced on an angle",
        "5 Tbsp coconut aminos  ((or sub tamari, but start with 1/2 the amount as it’s saltier))",
        "3 Tbsp rice vinegar",
        "2 ½ Tbsp toasted sesame oil",
        "1 ½ Tbsp maple syrup",
        "1 Tbsp fresh grated ginger  ((mince instead of grating for less pungent taste))",
        "4 cloves garlic, minced",
        "2 Tbsp sesame seeds, slightly toasted",
        "1/4 cup slivered almonds, slightly toasted",
        "1 healthy pinch each sea salt and black pepper  ((plus more to taste))",
        "Chili garlic sauce ((optional))"
    ],
    "instructions": [
        "Start by bringing a pot of water to a boil. Then add chicken, slightly reduce heat to medium-high, cover, and cook until done all the way through — about 10 minutes. Then remove and use two forks to shred. Set aside.",
        "In the meantime, prepare dressing by adding coconut aminos, rice vinegar, sesame oil, maple syrup, fresh ginger, and garlic to a jar (or mixing bowl) and shaking vigorously (or whisking) to combine.",
        "Taste and adjust flavor as needed, adding more ginger for zing, garlic for kick, maple syrup for sweetness, sesame oil for more prominent toasted sesame flavor, or coconut aminos for more saltiness. Set aside.",
        "Shred your napa cabbage, red cabbage, and carrot, slice the green onions, and add to a large serving dish or bowl. Toss to combine.",
        "Next add sesame seeds and almonds to a small pan and toast over medium heat for ~5 minutes until just slightly golden brown, stirring frequently. Be careful not to burn. Set aside to cool.",
        "Add shredded chicken breast to salad, along with toasted sesame seeds and almonds. Top with dressing and toss to combine. Season with a bit of salt and pepper for more flavor. Sample salad and add more salt and/or pepper to taste or more coconut aminos for depth of flavor.",
        "Serve immediately or store leftovers covered in the refrigerator up to 3-4 days. Not freezer friendly."
    ],
    "servings": "",
    "nutrition": ""
}