{
    "name": "General Tso's Cauliflower (vegetarian meal-prep idea) - Fit Foodie Finds",
    "link": "",
    "cuisine": "",
    "tags": [
        ""
    ],
    "ingredients": [
        "1 medium head of cauliflower, chopped into florets (~4–6 cups)",
        "3 large eggs",
        "1 cup whole wheat breadcrumbs (any kind)",
        "2 tablespoons white sesame seeds",
        "1 tablespoon garlic powder",
        "1 tablespoon coconut sugar",
        "1/8 teaspoon salt",
        "1 tablespoon chili garlic sauce",
        "2.5 tablespoons soy sauce (or tamari)",
        "1/2 tablespoon orange juice",
        "1 teaspoon tomato paste",
        "1 teaspoon sriracha",
        "1/4 cup honey"
    ],
    "instructions": [
        "First, preheat oven to 400ºF and spray a baking sheet with nonstick cooking spray.",
        "Next, Prep cauliflower by washing and patting dry. Then, cut into bite-sized florets and set aside.",
        "Crack 3 eggs into a medium bowl and use a fork to whisk. Set egg wash aside.",
        "Prepare the breading. Place breadcrumbs, sesame seeds, garlic powder, coconut sugar, and salt into a large bowl and mix until combined.",
        "Dip each cauliflower floret into the egg wash, making sure to fully coat the entire thing.",
        "Then, dip each piece of cauliflower into the breadcrumb mixture, coating the entire thing.",
        "Place on cookie sheet and repeat until all florets are coated.",
        "Bake cauliflower florets at 400ºF for 15 minutes.",
        "Remove baking sheet from oven and carefully flip each cauliflower wing over.",
        "Place back into the oven and bake at 400ºF for another 10 minutes.",
        "While the cauliflower wings are baking, prepare sauce.",
        "In a large bowl, mix together chili garlic sauce, soy sauce, orange juice, tomato paste, sriracha and honey. Set aside.",
        "When the cauliflower is done roasting. Let cool for around 5 minutes. Then, transfer the cauliflower into the large bowl with the sauce.",
        "Toss cauliflower in sauce making sure that everything is fully coated.",
        "Serve cauliflower on top of your favorite grain with sesame seeds and red pepper flakes."
    ],
    "servings": "",
    "nutrition": ""
}