{
    "name": "Grilled Romaine Caesar Salad with Herbed White Beans",
    "link": "",
    "cuisine": "",
    "tags": [
        "salad",
        "vegetarian"
    ],
    "ingredients": [
        "2 large heads romaine lettuce",
        "1 Tbsp avocado oil or olive oil  ((avocado is best for grilling because of its high smoke point))",
        "Pinch each sea salt and black pepper",
        "Vegan parmesan cheese, for topping ((optional))",
        "1 15-ounce can white or butter beans ((rinsed and drained))",
        "1 clove minced garlic",
        "1 Tbsp lemon juice",
        "1 Tbsp olive oil or avocado oil",
        "1/4 tsp each sea salt + black pepper",
        "2 Tbsp fresh parsley, chopped ((plus more for topping))",
        "1 cup raw cashews",
        "1 tsp dijon mustard",
        "1/2 tsp each sea salt + black pepper ((plus more to taste))",
        "8-12 medium cloves fresh garlic ((chopped))",
        "4 tsp capers in brine",
        "2 tsp brine juice from capers",
        "6 Tbsp lemon juice ( (2 large lemons yield ~6 Tbsp or 90 ml))",
        "3-4 Tbsp olive oil",
        "1 tsp chickpea (or soy) miso paste ((optional))",
        "1 tsp pure maple syrup  ((or sub stevia to taste))",
        "1/2 cup hot water  ((plus more to thin))"
    ],
    "instructions": [
        "\u2028If using a grill, heat your grill at this time or get out a grill pan (like this one).",
        "Prepare romaine by leaving whole, but removing any bruised or broken leaves. Then rinse the head of lettuce to remove any dirt. Pat dry with a clean towel.&nbsp;",
        "Use a knife to carefully cut the romaine heads in half lengthwise and use a paper or cloth towel to clean any remaining bits of dirt from the inner leaves. Then arrange on a baking sheet and lightly drizzle the cut sides with oil. Sprinkle with salt and pepper and set aside.",
        "In the meantime, add rinsed and drained white beans to a small mixing bowl along with garlic, lemon juice, olive oil, sea salt, black pepper, and fresh parsley. Toss to combine. Taste and adjust flavor as needed, adding more lemon for acidity, salt to taste, or garlic for zing. Set aside.",
        "Next, prepare dressing. Add raw cashews, dijon mustard, salt, pepper, fresh garlic, capers, brine juice (from capers), lemon, olive oil, miso paste (optional), maple syrup, and hot water to a small or high-speed blender. Blend until creamy and smooth, scraping down sides as needed. Add enough water to thin until pourable.&nbsp;Taste and adjust flavor as needed, adding more lemon for acidity, salt to taste, maple syrup for sweetness, or garlic for zing. Set aside.",
        "If using a grill pan, heat over high heat now and lightly coat surface with oil. Then place romaine on the hot grill or grill pan and grill for 1-2 minutes on each side, or until there are visible grill marks. Turn carefully as it gets a little fragile when exposed to the heat.&nbsp;",
        "Remove romaine and transfer to a large cutting board. Top with white beans and desired amount of dressing. Vegan parmesan cheese and extra parsley make excellent garnishes (optional). Once the salad is dressed, we recommend chopping into large bites with a knife, lightly tossing on the cutting board, and transferring to a serving bowl or platter!",
        "Best when fresh. Leftover dressing will keep covered in the refrigerator up to 5-7 days."
    ],
    "servings": "",
    "nutrition": ""
}