{
    "name": "Healthy Sweet Potato Casserole (Pecan Oat Topping!) - Fit Foodie Finds",
    "link": "",
    "cuisine": "",
    "tags": [
        "vegetarian",
        "casserole"
    ],
    "ingredients": [
        "3 large sweet potatoes (~3 cups, mashed)",
        "1 tablespoon olive oil",
        "1/4 cup almond milk",
        "1/4 cup nonfat Greek yogurt",
        "1/8 teaspoon salt",
        "1 cup pecans",
        "1/4 cup rolled oats",
        "6 slices bacon, cooked and minced",
        "3 tablespoons room temperature butter (or coconut oil)",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground cardamom",
        "1/4 teaspoon ground nutmeg",
        "2 tablespoons brown sugar or coconut sugar"
    ],
    "instructions": [
        "First, preheat your oven to 400ºF and spray an 8×8-inch baking dish with cooking spray. Set aside.",
        "Next, peel sweet potatoes and chop them into 2-inch cubes. Place them on a baking sheet and drizzle with olive oil and toss.",
        "Bake sweet potatoes for 25 minutes or until tender. Toss halfway.",
        "While sweet potatoes are baking, place all ingredients for the pecan topping (except for bacon) into a large food processor. Pulse on high until ingredients form a crumble.",
        "Add bacon to the food processor and pulse a couple more times to incorporate the bacon bits into the mixture. Remove crumble mixture from the food processor and place into a separate bowl.",
        "Place roasted sweet potatoes, almond milk, Greek yogurt, and salt into the same food processor you used for the pecan mixture. Use the pulse feature to combine ingredients, but do not totally puree the sweet potato. You want some chunks.",
        "Once mashed, add the sweet potato mixture to baking dish and use a spatula to spread out evenly. Then, sprinkle pecan mixture over the top.",
        "Bake the casserole at 350ºF for 25 minutes."
    ],
    "servings": "",
    "nutrition": ""
}