{
    "name": "Instant Pot Apple Crisp - Fit Foodie Finds",
    "link": "",
    "cuisine": "",
    "tags": [
        "dessert"
    ],
    "ingredients": [
        "3 medium apples, chopped (~3 cups chopped)",
        "3 tablespoons almond flour",
        "1/2 lemon, juiced",
        "2 tablespoon water",
        "1 tablespoon maple syrup",
        "2 teaspoons ground cinnamon",
        "1/4 cup brown sugar (or coconut sugar)",
        "1/4 cup almond flour",
        "1/2 cup rolled oats",
        "1/4 cup pecans, chopped",
        "2 teaspoons cinnamon",
        "1/4 teaspoon cardamom",
        "1/4 teaspoon ginger",
        "2 tablespoons butter, softened",
        "2 tablespoons coconut oil, softened"
    ],
    "instructions": [
        "Spray two large Weck or Mason jars with cooking spray. Set aside.*",
        "In a medium bowl, mix all ingredients for the apples together. Make sure apples are coated with spices. Set aside.",
        "Turn on the Instant Pot’s saute feature. Add pecans and oats to the bottom of the Instant Pot and let cook for 4-5 minutes stirring frequently to avoid burning. You are essentially toasting your pecans and oats. Shut off Instant Pot and remove oats and pecans and place into a medium-size bowl.",
        "Place the rest of the topping ingredients into the bowl with the toasted oats and pecans and use your hands or a wooden spoon to mix all ingredients together.",
        "Next, pour the apple mixture evenly into the two the jars (making sure to get some liquid in each jar). With your hands, add an equal amount of crumble topping to the top of each apple mixture. Press the topping into the apples with your hands.",
        "Place both jars on the bottom of the Instant Pot. Pour 2-3 cups of water into your Instant Pot surrounding the jars.",
        "Close the lid to the Instant Pot and turn the pressure valve to seal. Cook on manual high pressure for 17 minutes.*",
        "Quick release pressure and remove Mason jars from the Instant Pot."
    ],
    "servings": "",
    "nutrition": ""
}