{
    "name": "Instant Pot Stuffed Spaghetti Squash (vegetarian!) - Fit Foodie Finds",
    "link": "",
    "cuisine": "",
    "tags": [
        "instantpot",
        "vegetarian"
    ],
    "ingredients": [
        "1 2-lb. spaghetti squash",
        "1 tablespoon olive oil",
        "1/2 medium white onion, minced",
        "3 cloves garlic, peeled and minced",
        "8 oz. crimini mushrooms, chopped",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground pepper",
        "1/2 cup vegetable broth (but any kind works!)",
        "4 cups chopped kale, deboned",
        "1/2 cup julienned sun-dried tomatoes (in oil)",
        "1 tablespoon tomato paste",
        "1/4 cup shaved parmesan",
        "Optional: 1/4 cup toasted pine nuts"
    ],
    "instructions": [
        "First, prepare the spaghetti squash by cutting off the stem end of the squash with a sharp knife. Set the spaghetti squash flat on a cutting board and carefully cut the squash in half (hot dog style).",
        "Use a spoon to scoop out the seeds and then discard the seeds. Lightly season squash halves with salt and pepper. Set aside.",
        "Next, turn the on Instant Pot’s saute feature and add 1 tablespoon olive oil to the bottom of the pot.",
        "When the olive oil is fragrant, add onion to the pot and saute for 1 minute. Then, add garlic, chopped mushrooms, 1/4 teaspoon salt, and 1/4 teaspoon pepper and cook for an additional 2 minutes.",
        "Next, pour broth into the bottom of the pot and set the trivet on top of all of the vegetables.",
        "Place spaghetti squash halves on top of the trivet and cover the Instant Pot.",
        "Turn the pressure valve to seal and set the Instant Pot to manual >> high pressure for 6 minutes.",
        "It will take a few minutes for the Instant Pot to build pressure, but eventually it will count down from 6 minutes. When the timer goes off, quick release the Instant Pot.",
        "Then, carefully remove the squash and trivet from the Instant Pot and set aside.",
        "Turn the saute feature back on and add chopped kale, sun-dried tomatoes, and tomato paste to the pot. Saute everything together for 2-3 minutes or until the kale becomes softer and bright green.",
        "While the veggies are sauteeing, carefully scoop out the innards of the spaghetti squash. We like to use a fork to fluff the “squash noodles” and then scoop everything out. If you are serving this dish immediately, make sure to keep the squash skin intact so that you can serve it inside the squash half.",
        "Spoon the squash innards into the Instant Pot and saute everything together.",
        "Last, add parmesan cheese and mix again.",
        "Serve with toasted pine nuts and enjoy!"
    ],
    "servings": "",
    "nutrition": ""
}