{
    "name": "One Pot Vegetarian Thai Curry (Ready in Under 60 min!) - Fit Foodie Finds",
    "link": "",
    "cuisine": "",
    "tags": [
        "vegetarian",
        "thai"
    ],
    "ingredients": [
        "2 tablespoons coconut oil (or olive oil)",
        "5 cloves garlic, smashed and minced",
        "2 teaspoons freshly grated ginger",
        "1/2 large white onion, finely diced",
        "4 large carrots, sliced into coins (~3 cups)",
        "1/4 teaspoon salt",
        "2 medium green bell peppers, sliced",
        "12 oz. snow peas",
        "1 15-oz. can garbanzo beans, rinsed and drained",
        "1 cup instant white rice (instant brown rice works, too!)",
        "1 15-oz. can unsweetened full-fat coconut milk",
        "1.5 cup vegetable broth",
        "2.5 tablespoons red curry paste",
        "2 teaspoons rice vinegar",
        "1 tablespoon lime juice",
        "optional sweetener: 1-2 teaspoons maple syrup",
        "optional spice: 1-2 teaspoons sriracha or chili garlic sauce",
        "optional toppings: fresh cilantro and green onion."
    ],
    "instructions": [
        "Heat 2 tablespoons of coconut oil in a large skillet. When the coconut oil is fragrant, add garlic, ginger and onion. Saute for 1-2 minutes. Then, add in carrots and salt and continue to saute 2-3 more minutes.",
        "Add in sliced bell pepper, snow peas, and garbanzo beans and saute for 2 more minutes. You don’t want to cook everything down, just a quick saute.",
        "Then, add white rice, coconut milk, vegetable broth, red curry paste, and rice vinegar. Bring to a boil over medium/high heat. Once boiling. Cover and turn the heat down to low. Let simmer for 15-20 minutes or until the rice is fully cooked.",
        "Once the rice is fully cooked, squeeze in fresh lime juice. Then, give it a taste and adjust the salt, as needed. Option to add a little maple syrup if you prefer your curry on the sweeter side or some siracha/chili garlic sauce to make it spicier.",
        "Serve with fresh cilantro and green onion."
    ],
    "servings": "",
    "nutrition": ""
}