{
    "name": "Sweet Potato, Spinach, and Ricotta Stuffed Shells - Fit Foodie Finds",
    "link": "",
    "cuisine": "",
    "tags": [
        "vegetarian",
        "italian"
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1/4 large white onion, finely diced",
        "5 oz. fresh spinach",
        "1 cup full-fat ricotta cheese",
        "1 cup 4% cottage cheese",
        "1 15-oz. can sweet potato puree",
        "1/2 tablespoon minced garlic",
        "1/8 teaspoon salt",
        "1 24-oz. jar organic marinara sauce",
        "1/2 cup vegetable broth",
        "1 cup shredded mozzarella",
        "12 oz. jumbo shells"
    ],
    "instructions": [
        "First, preheat oven to 425ºF and spray a 9×13-inch casserole dish with non-stick cooking spray. Set aside.",
        "Next, heat a large nonstick skillet over medium/high heat and add olive oil.",
        "When olive oil is fragrant (that’s when you know it’s hot) add the onion to the pan and sauté for 1 minute. Then, add the fresh spinach to the pan and toss the spinach with the olive oil and onion.",
        "Sauté the spinach over medium heat for 4-5 minutes or until the spinach is wilted and then remove from heat.",
        "In a large bowl, mix together the ricotta cheese, cottage cheese, sweet potato puree, minced garlic, salt and wilted spinach. Set aside.",
        "Prepare the casserole dish and add 1 cup of your favorite marinara sauce, 1/2 cup of the cheese and sweet potato mixture , and 1/2 cup vegetable broth to the bottom of the casserole dish. Use a spatula to mix and then spread the sauce out evenly on the bottom of the dish.",
        "Stuff the jumbo shells individually by scooping the sweet potato and cheese mixture with the shell until it is full. Place the shell on the bottom of the casserole, open side up. Repeat until all shells are used or until the casserole dish is full.",
        "Finally, pour the remaining marinara sauce over the shells and cover the casserole dish with tin foil and bake at 425ºF for 60 minutes.",
        "Remove the casserole dish from the oven and uncover. Sprinkle mozzarella over the shells and bake for another 10 minutes or until cheese is melted."
    ],
    "servings": "",
    "nutrition": ""
}