{
    "name": "Vegan Buffalo Cauliflower Salad - Fit Foodie Finds",
    "link": "",
    "cuisine": "",
    "tags": [
        ""
    ],
    "ingredients": [
        "½ cup unsweetened almond milk",
        "¾ cup almond flour",
        "2 teaspoons garlic powder",
        "2 teaspoons onion powder",
        "1 teaspoon ground cumin",
        "1 teaspoon paprika",
        "¼ teaspoon fine sea salt",
        "¼ teaspoon pepper",
        "8 cups cauliflower florets (from 2 medium heads)",
        "1 tablespoon coconut oil, melted",
        "½ cup hot sauce (I like Frank’s RedHot)",
        "1 cup raw cashews, soaked for at least 3 hours, drained, and rinsed",
        "¾ cup unsweetened almond milk",
        "2 large garlic cloves",
        "2 tablespoons fresh lemon juice, plus more to taste",
        "2 tablespoons white wine vinegar",
        "1 teaspoon Dijon mustard",
        "Fine sea salt and pepper",
        "12 cups spinach, coarsely chopped",
        "2 carrots, shaved into strips with a vegetable peeler",
        "2 celery stalks, chopped",
        "2 ripe avocados, pitted, peeled, and cubed",
        "¼ cup roasted salted pepitas (pumpkin seeds)"
    ],
    "instructions": [
        "Make the cauliflower. Preheat the oven to 450 degrees. Line a baking sheet with parchment paper.",
        "In a large bowl, whisk together the almond milk, almond flour, garlic powder, onion powder, cumin, paprika, salt, pepper, and ½ cup water. Add the cauliflower and toss to coat, making sure to get the batter into all the crevices. Place the cauliflower florets on the prepared baking sheet and roast until browned in spots, about 20 minutes. Remove from the oven, but keep the oven on.",
        "In a separate large bowl, whisk the coconut oil with the hot sauce. Add the hot cauliflower and toss to coat. Replace the parchment paper with a clean sheet. Return the cauliflower to the baking sheet and roast for about 20 minutes, until the sauce is browned.",
        "Meanwhile, make the ranch dressing. In a high-speed blender, combine the cashews, almond milk, garlic, lemon juice, vinegar, and mustard and blend until creamy. Season with salt and pepper.",
        "Make the salad. Pour ½ cup of the dressing into a clean large bowl. Add the spinach, carrots, celery, and avocado and toss well. Divide the salad among four plates and top with the Buffalo cauliflower and the pepitas. Drizzle with more of the dressing and serve, passing any remaining dressing at the table."
    ],
    "servings": "",
    "nutrition": ""
}